[{"GraphDB1":"http:\/\/www.semanticweb.org\/N#CO-CLO-001","GraphDB2":"NICEX:CO-CLO-001","NICE_Role_Title":"All Source-Collection Manager","NICE_Role_Description":"Identifies collection authorities and environment; incorporates priority information requirements into collection management; develops concepts to meet leadership's intent. Determines capabilities of available collection assets, identifies new collection capabilities; and constructs and disseminates collection plans. Monitors execution of tasked collection to ensure effective execution of the collection plan."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#CO-CLO-002","GraphDB2":"NICEX:CO-CLO-002","NICE_Role_Title":"All Source-Collection Requirements Manager","NICE_Role_Description":"Evaluates collection operations and develops effects-based collection requirements strategies using available sources and methods to improve collection. Develops, processes, validates, and coordinates submission of collection requirements. Evaluates performance of collection assets and collection operations."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#AN-ASA-001","GraphDB2":"NICEX:AN-ASA-001","NICE_Role_Title":"All-Source Analyst","NICE_Role_Description":"Analyzes data\/information from one or multiple sources to conduct preparation of the environment, respond to requests for information, and submit intelligence collection and production requirements in support of planning and operations."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-RSK-001","GraphDB2":"NICEX:SP-RSK-001","NICE_Role_Title":"Authorizing Official","NICE_Role_Description":"Senior official or executive with the authority to formally assume responsibility for operating an information system at an acceptable level of risk to organizational operations (including mission, functions, image, or reputation), organizational assets, individuals, other organizations, and the Nation (CNSSI 4009)."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-MGT-002","GraphDB2":"NICEX:OV-MGT-002","NICE_Role_Title":"Communications Security (COMSEC) Manager","NICE_Role_Description":"Individual who manages the Communications Security (COMSEC) resources of an organization (CNSSI 4009) or key custodian for a Crypto Key Management System (CKMS)."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#IN-INV-001","GraphDB2":"NICEX:IN-INV-001","NICE_Role_Title":"Cyber Crime Investigator","NICE_Role_Description":"Identifies, collects, examines, and preserves evidence using controlled and documented analytical and investigative techniques."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#PR-CDA-001","GraphDB2":"NICEX:PR-CDA-001","NICE_Role_Title":"Cyber Defense Analyst","NICE_Role_Description":"Uses data collected from a variety of cyber defense tools (e.g., IDS alerts, firewalls, network traffic logs) to analyze events that occur within their environments for the purposes of mitigating threats."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#IN-FOR-002","GraphDB2":"NICEX:IN-FOR-002","NICE_Role_Title":"Cyber Defense Forensics Analyst","NICE_Role_Description":"Analyzes digital evidence and investigates computer security incidents to derive useful information in support of system\/network vulnerability mitigation."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#PR-CIR-001","GraphDB2":"NICEX:PR-CIR-001","NICE_Role_Title":"Cyber Defense Incident Responder","NICE_Role_Description":"Investigates, analyzes, and responds to cyber incidents within the network environment or enclave."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#PR-INF-001","GraphDB2":"NICEX:PR-INF-001","NICE_Role_Title":"Cyber Defense Infrastructure Support Specialist","NICE_Role_Description":"Tests, implements, deploys, maintains, and administers the infrastructure hardware and software."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-TEA-001","GraphDB2":"NICEX:OV-TEA-001","NICE_Role_Title":"Cyber Instructional Curriculum Developer","NICE_Role_Description":"Develops, plans, coordinates, and evaluates cyber training\/education courses, methods, and techniques based on instructional needs."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-TEA-002","GraphDB2":"NICEX:OV-TEA-002","NICE_Role_Title":"Cyber Instructor","NICE_Role_Description":"Develops and conducts training or education of personnel within cyber domain."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#CO-OPL-001","GraphDB2":"NICEX:CO-OPL-001","NICE_Role_Title":"Cyber Intel Planner","NICE_Role_Description":"Develops detailed intelligence plans to satisfy cyber operations requirements. Collaborates with cyber operations planners to identify, validate, and levy requirements for collection and analysis. Participates in targeting selection, validation, synchronization, and execution of cyber actions. Synchronizes intelligence activities to support organization objectives in cyberspace."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-LGA-001","GraphDB2":"NICEX:OV-LGA-001","NICE_Role_Title":"Cyber Legal Advisor","NICE_Role_Description":"Provides legal advice and recommendations on relevant topics related to cyber law."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#CO-OPS-001","GraphDB2":"NICEX:CO-OPS-001","NICE_Role_Title":"Cyber Operator","NICE_Role_Description":"Conducts collection, processing, and\/or geolocation of systems to exploit, locate, and\/or track targets of interest. Performs network navigation, tactical forensic analysis, and, when directed, executes on-net operations."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#CO-OPL-002","GraphDB2":"NICEX:CO-OPL-002","NICE_Role_Title":"Cyber Ops Planner","NICE_Role_Description":"Develops detailed plans for the conduct or support of the applicable range of cyber operations through collaboration with other planners, operators and\/or analysts. Participates in targeting selection, validation, synchronization, and enables integration during the execution of cyber actions."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-SPP-002","GraphDB2":"NICEX:OV-SPP-002","NICE_Role_Title":"Cyber Policy and Strategy Planner","NICE_Role_Description":"Develops and maintains cybersecurity plans, strategy, and policy to support and align with organizational cybersecurity initiatives and regulatory compliance."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-SPP-001","GraphDB2":"NICEX:OV-SPP-001","NICE_Role_Title":"Cyber Workforce Developer and Manager","NICE_Role_Description":"Develops cyberspace workforce plans, strategies, and guidance to support cyberspace workforce manpower, personnel, training and education requirements and to address changes to cyberspace policy, doctrine, materiel, force structure, and education and training requirements."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OM-DTA-002","GraphDB2":"NICEX:OM-DTA-002","NICE_Role_Title":"Data Analyst","NICE_Role_Description":"Examines data from multiple disparate sources with the goal of providing security and privacy insight. Designs and implements custom algorithms, workflow processes, and layouts for complex, enterprise-scale data sets used for modeling, data mining, and research purposes."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OM-DTA-001","GraphDB2":"NICEX:OM-DTA-001","NICE_Role_Title":"Database Administrator","NICE_Role_Description":"Administers databases and\/or data management systems that allow for the secure storage, query, protection, and utilization of data."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-ARC-001","GraphDB2":"NICEX:SP-ARC-001","NICE_Role_Title":"Enterprise Architect","NICE_Role_Description":"Develops and maintains business, systems, and information processes to support enterprise mission needs; develops information technology (IT) rules and requirements that describe baseline and target architectures."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-EXL-001","GraphDB2":"NICEX:OV-EXL-001","NICE_Role_Title":"Executive Cyber Leadership","NICE_Role_Description":"Executes decision-making authorities and establishes vision and direction for an organization's cyber and cyber-related resources and\/or operations."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#AN-EXP-001","GraphDB2":"NICEX:AN-EXP-001","NICE_Role_Title":"Exploitation Analyst","NICE_Role_Description":"Collaborates to identify access and collection gaps that can be satisfied through cyber collection and\/or preparation activities. Leverages all authorized resources and analytic techniques to penetrate targeted networks."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#IN-FOR-001","GraphDB2":"NICEX:IN-FOR-001","NICE_Role_Title":"Forensics Analyst","NICE_Role_Description":"Conducts detailed investigations on computer-based crimes establishing documentary or physical evidence, to include digital media and logs associated with cyber intrusion incidents."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-PMA-004","GraphDB2":"NICEX:OV-PMA-004","NICE_Role_Title":"IT Investment\/Portfolio Manager","NICE_Role_Description":"Manages a portfolio of IT investments that align with the overall needs of mission and enterprise priorities."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-PMA-005","GraphDB2":"NICEX:OV-PMA-005","NICE_Role_Title":"IT Program Auditor","NICE_Role_Description":"Conducts evaluations of an IT program or its individual components to determine compliance with published standards."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-SYS-001","GraphDB2":"NICEX:SP-SYS-001","NICE_Role_Title":"Information Systems Security Developer","NICE_Role_Description":"Designs, develops, tests, and evaluates information system security throughout the systems development life cycle."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-MGT-001","GraphDB2":"NICEX:OV-MGT-001","NICE_Role_Title":"Information Systems Security Manager","NICE_Role_Description":"Responsible for the cybersecurity of a program, organization, system, or enclave."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-PMA-002","GraphDB2":"NICEX:OV-PMA-002","NICE_Role_Title":"Information Technology (IT) Project Manager","NICE_Role_Description":"Directly manages information technology projects."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OM-KMG-001","GraphDB2":"NICEX:OM-KMG-001","NICE_Role_Title":"Knowledge Manager","NICE_Role_Description":"Responsible for the management and administration of processes and tools that enable the organization to identify, document, and access intellectual capital and information content."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#AN-ASA-002","GraphDB2":"NICEX:AN-ASA-002","NICE_Role_Title":"Mission Assessment Specialist","NICE_Role_Description":"Develops assessment plans and measures of performance\/effectiveness. Conducts strategic and operational effectiveness assessments as required for cyber events. Determines whether systems performed as expected and provides input to the determination of operational effectiveness."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#AN-LNG-001","GraphDB2":"NICEX:AN-LNG-001","NICE_Role_Title":"Multi-Disciplined Language Analyst","NICE_Role_Description":"Applies language and culture expertise with target\/threat and technical knowledge to process, analyze, and\/or disseminate intelligence information derived from language, voice and\/or graphic material. Creates and maintains language-specific databases and working aids to support cyber action execution and ensure critical knowledge sharing. Provides subject matter expertise in foreign language-intensive or interdisciplinary projects."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OM-NET-001","GraphDB2":"NICEX:OM-NET-001","NICE_Role_Title":"Network Operations Specialist","NICE_Role_Description":"Plans, implements, and operates network services\/systems, to include hardware and virtual environments."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#CO-OPL-003","GraphDB2":"NICEX:CO-OPL-003","NICE_Role_Title":"Partner Integration Planner","NICE_Role_Description":"Works to advance cooperation across organizational or national borders between cyber operations partners. Aids the integration of partner cyber teams by providing guidance, resources, and collaboration to develop best practices and facilitate organizational support for achieving objectives in integrated cyber actions."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-LGA-002","GraphDB2":"NICEX:OV-LGA-002","NICE_Role_Title":"Privacy Officer\/Privacy Compliance Manager","NICE_Role_Description":"Develops and oversees privacy compliance program and privacy program staff, supporting privacy compliance, governance\/policy, and incident response needs of privacy and security executives and their teams."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-PMA-003","GraphDB2":"NICEX:OV-PMA-003","NICE_Role_Title":"Product Support Manager","NICE_Role_Description":"Manages the package of support functions required to field and maintain the readiness and operational capability of systems and components."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OV-PMA-001","GraphDB2":"NICEX:OV-PMA-001","NICE_Role_Title":"Program Manager","NICE_Role_Description":"Leads, coordinates, communicates, integrates, and is accountable for the overall success of the program, ensuring alignment with agency or enterprise priorities."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-TRD-001","GraphDB2":"NICEX:SP-TRD-001","NICE_Role_Title":"Research and Development Specialist","NICE_Role_Description":"Conducts software and systems engineering and software systems research to develop new capabilities, ensuring cybersecurity is fully integrated. Conducts comprehensive technology research to evaluate potential vulnerabilities in cyberspace systems."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-DEV-002","GraphDB2":"NICEX:SP-DEV-002","NICE_Role_Title":"Secure Software Assessor","NICE_Role_Description":"Analyzes the security of new or existing computer applications, software, or specialized utility programs and provides actionable results."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-ARC-002","GraphDB2":"NICEX:SP-ARC-002","NICE_Role_Title":"Security Architect","NICE_Role_Description":"Ensures that the stakeholder security requirements necessary to protect the organization’s mission and business processes are adequately addressed in all aspects of enterprise architecture including reference models, segment and solution architectures, and the resulting systems supporting those missions and business processes."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-RSK-002","GraphDB2":"NICEX:SP-RSK-002","NICE_Role_Title":"Security Control Assessor","NICE_Role_Description":"Conducts independent comprehensive assessments of the management, operational, and technical security controls and control enhancements employed within or inherited by an information technology (IT) system to determine the overall effectiveness of the controls (as defined in NIST SP 800-37)."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-DEV-001","GraphDB2":"NICEX:SP-DEV-001","NICE_Role_Title":"Software Developer","NICE_Role_Description":"Develops, creates, maintains, and writes\/codes new (or modifies existing) computer applications, software, or specialized utility programs."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OM-ADM-001","GraphDB2":"NICEX:OM-ADM-001","NICE_Role_Title":"System Administrator","NICE_Role_Description":"Responsible for setting up and maintaining a system or specific components of a system (e.g. for example, installing, configuring, and updating hardware and software; establishing and managing user accounts; overseeing or conducting backup and recovery tasks; implementing operational and technical security controls; and adhering to organizational security policies and procedures)."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-TST-001","GraphDB2":"NICEX:SP-TST-001","NICE_Role_Title":"System Test & Evaluation Specialist","NICE_Role_Description":"Plans, prepares, and executes tests of systems to evaluate results against specifications and requirements as well as analyze\/report test results."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-SYS-002","GraphDB2":"NICEX:SP-SYS-002","NICE_Role_Title":"Systems Developer","NICE_Role_Description":"Designs, develops, tests, and evaluates information systems throughout the systems development life cycle."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#SP-SRP-001","GraphDB2":"NICEX:SP-SRP-001","NICE_Role_Title":"Systems Requirements Planner","NICE_Role_Description":"Consults with customers to evaluate functional requirements and translate functional requirements into technical solutions."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OM-ANA-001","GraphDB2":"NICEX:OM-ANA-001","NICE_Role_Title":"Systems Security Analyst","NICE_Role_Description":"Responsible for the analysis and development of the integration, testing, operations, and maintenance of systems security."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#AN-TGT-001","GraphDB2":"NICEX:AN-TGT-001","NICE_Role_Title":"Target Developer","NICE_Role_Description":"Performs target system analysis, builds and\/or maintains electronic target folders to include inputs from environment preparation, and\/or internal or external intelligence sources. Coordinates with partner target activities and intelligence organizations, and presents candidate targets for vetting and validation."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#AN-TGT-002","GraphDB2":"NICEX:AN-TGT-002","NICE_Role_Title":"Target Network Analyst","NICE_Role_Description":"Conducts advanced analysis of collection and open-source data to ensure target continuity; to profile targets and their activities; and develop techniques to gain more target information. Determines how targets communicate, move, operate and live based on knowledge of target technologies, digital networks, and the applications on them."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#OM-STS-001","GraphDB2":"NICEX:OM-STS-001","NICE_Role_Title":"Technical Support Specialist","NICE_Role_Description":"Provides technical support to customers who need assistance utilizing client-level hardware and software in accordance with established or approved organizational process components (i.e., Master Incident Management Plan, when applicable)."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#AN-TWA-001","GraphDB2":"NICEX:AN-TWA-001","NICE_Role_Title":"Threat\/Warning Analyst","NICE_Role_Description":"Develops cyber indicators to maintain awareness of the status of the highly dynamic operating environment. Collects, processes, analyzes, and disseminates cyber threat\/warning assessments."},{"GraphDB1":"http:\/\/www.semanticweb.org\/N#PR-VAM-001","GraphDB2":"NICEX:PR-VAM-001","NICE_Role_Title":"Vulnerability Assessment Analyst","NICE_Role_Description":"Performs assessments of systems and networks within the network environment or enclave and identifies where those systems\/networks deviate from acceptable configurations, enclave policy, or local policy. Measures effectiveness of defense-in-depth architecture against known vulnerabilities."}]